#+TITLE: Data Science
#+OPTIONS: num:nil
#+SETUPFILE: /home/silin/.emacs.d/org-html-themes/org/theme-readtheorg.setup
#+STARTUP: overview
** statistical mothode
#+BEGIN_SRC python :results output
  from scipy import stats
  from scipy.stats import norm
  import numpy as np
  import scipy as sp
  print(sp.stats.t.ppf(0.95,6))
  print(norm.cdf([-1,0,1]))
  print(norm.cdf(np.array([-1,0,1])))
  print(norm.mean(), norm.std(), norm.var() )
  print(norm.pdf(0))
  print(norm.cdf(1.96))
  print(norm.ppf(0.975))
  print(norm.cdf(1))
  print(norm.ppf(0.841344746090))
  print(norm.sf(1-norm.cdf(1)))
  print(norm.ppf(0.9))
  print(stats.t.ppf(0.975,3))
  print(stats.t.ppf(0.975,3))

#+END_SRC

#+RESULTS:
#+begin_example
1.9431802803927816
[0.15865525 0.5        0.84134475]
[0.15865525 0.5        0.84134475]
0.0 1.0 1.0
0.3989422804014327
0.9750021048517795
1.959963984540054
0.8413447460685429
1.0000000000886762
0.4369702468636344
1.2815515655446004
3.182446305284263
3.182446305284263
#+end_example

** single  master node configuration with
#+begin_src sh :results output
cat ~/Documents/spark/myown/test.py
#+end_src
#+RESULTS:
 from pyspark.sql import SparkSession
 spark = SparkSession.builder.appName("examples").getOrCreate()
 
print("hello world")

#+begin_src 
cd .../spark
./sbin/start-all
curl localhost:8080(spark-url for master)
./bin/spark-submit --master spark-url ./myown/test.py
#+end_src
test.py will be executed 

#+begin_src 
./bin/pyspark --master spark-url 
#+end_src
will open  a terminal with master configuration

** 03-01
#+begin_src sql :engine postgresql :dbhost localhost :dbuser postgres :dbpassword du :database postgres :dbport 5432
    drop table if exists WikipediaArticles ;
    create table WikipediaArticles (
    id int,
    title varchar(50), 
    text varchar(50),
    category varchar(50),
    link int
    ) ;
    \d wikipediaarticles;
#+end_src

#+RESULTS:
| DROP TABLE                       |                       |           |          |         |
|----------------------------------+-----------------------+-----------+----------+---------|
| CREATE TABLE                     |                       |           |          |         |
| Table "public.wikipediaarticles" |                       |           |          |         |
| Column                           | Type                  | Collation | Nullable | Default |
| id                               | integer               |           |          |         |
| title                            | character varying(50) |           |          |         |
| text                             | character varying(50) |           |          |         |
| category                         | character varying(50) |           |          |         |
| link                             | integer               |           |          |         |


#+begin_src sql :engine postgresql :dbhost localhost :dbuser postgres :dbpassword du :database postgres :dbport 5432
  drop table if exists linkarticles ;
      create table linkarticles (
      id int,
      linked int
   ) ;
#+end_src

#+RESULTS:
| DROP TABLE   |
|--------------|
| CREATE TABLE |



#+begin_src sql :engine postgresql :dbhost localhost :dbuser postgres :dbpassword du :database postgres :dbport 5432
  delete from wikipediaarticles where id = 1;
  insert into WikipediaArticles (id, title, text, category, link) values (1, 'math', 'mathematics and nature and nature', 'nature', 1) ;
  delete from wikipediaarticles where id = 2;
  insert into WikipediaArticles (id, title, text, category, link) values (2, 'phy', 'physics', 'nature', 2) ;
  delete from wikipediaarticles where id = 3;
  insert into WikipediaArticles (id, title, text, category, link) values (3, 'chemie', 'chemistry', 'science', 3) ;
  delete from wikipediaarticles where id = 4;
  insert into WikipediaArticles (id, title, text, category, link) values (4, 'bio', 'biology', 'science', 4) ;
  select * from wikipediaarticles ;
#+end_src

#+RESULTS:
| DELETE 0   |        |                                   |          |      |
|------------+--------+-----------------------------------+----------+------|
| INSERT 0 1 |        |                                   |          |      |
| DELETE 0   |        |                                   |          |      |
| INSERT 0 1 |        |                                   |          |      |
| DELETE 0   |        |                                   |          |      |
| INSERT 0 1 |        |                                   |          |      |
| DELETE 0   |        |                                   |          |      |
| INSERT 0 1 |        |                                   |          |      |
| id         | title  | text                              | category | link |
| 1          | math   | mathematics and nature and nature | nature   |    1 |
| 2          | phy    | physics                           | nature   |    2 |
| 3          | chemie | chemistry                         | science  |    3 |
| 4          | bio    | biology                           | science  |    4 |


#+begin_src sql :engine postgresql :dbhost localhost :dbuser postgres :dbpassword du :database postgres :dbport 5432
  delete from linkarticles where id = 1;
  insert into Linkarticles (id, linked) values (1, 2) ;
  insert into Linkarticles (id, linked) values (1, 3) ;
  delete from linkarticles where id = 2;
  insert into Linkarticles (id, linked) values (2, 3) ;
  delete from linkarticles where id = 3;
  insert into Linkarticles (id, linked) values (3, 4) ;
  delete from linkarticles where id = 4;
  insert into Linkarticles (id, linked) values (4, 1) ;
  select * from linkarticles ;
#+end_src

#+RESULTS:
| DELETE 0   |        |
|------------+--------|
| INSERT 0 1 |        |
| INSERT 0 1 |        |
| DELETE 0   |        |
| INSERT 0 1 |        |
| DELETE 0   |        |
| INSERT 0 1 |        |
| DELETE 0   |        |
| INSERT 0 1 |        |
| id         | linked |
| 1          |      2 |
| 1          |      3 |
| 2          |      3 |
| 3          |      4 |
| 4          |      1 |


#+begin_src sql :engine postgresql :dbhost localhost :dbuser postgres :dbpassword du :database postgres :dbport 5432
select * from wikipediaarticles where title = 'phy';
#+end_src

#+RESULTS:
| id | title | text    | category | link |
|----+-------+---------+----------+------|
|  2 | phy   | physics | nature   |    2 |


#+begin_src sql :engine postgresql :dbhost localhost :dbuser postgres :dbpassword du :database postgres :dbport 5432
  select * from wikipediaarticles where id in
   (select linked from linkarticles where id in
    (select id from wikipediaarticles where title = 'math')
  );

#+end_src

#+RESULTS:
| id | title  | text      | category | link |
|----+--------+-----------+----------+------|
|  2 | phy    | physics   | nature   |    2 |
|  3 | chemie | chemistry | science  |    3 |


#+begin_src sql :engine postgresql :dbhost localhost :dbuser postgres :dbpassword du :database postgres :dbport 5432
  select count(*) , linked from linkarticles group by linked;
#+end_src

#+RESULTS:
| count | linked |
|-------+--------|
|     2 |      3 |
|     1 |      4 |
|     1 |      2 |
|     1 |      1 |


#+begin_src sql :engine postgresql :dbhost localhost :dbuser postgres :dbpassword du :database postgres :dbport 5432
  select unnest(string_to_array('this is is is a test', ' '))
#+end_src

#+RESULTS:
| unnest |
|--------|
| this   |
| is     |
| is     |
| is     |
| a      |
| test   |


#+begin_src sql :engine postgresql :dbhost localhost :dbuser postgres :dbpassword du :database postgres :dbport 5432
select id,  unnest(string_to_array(text , ' ')) as word, count(*) from WikipediaArticles group by id, word
#+end_src

#+RESULTS:
| id | word        | count |
|----+-------------+-------|
|  4 | biology     |     1 |
|  3 | chemistry   |     1 |
|  2 | physics     |     1 |
|  1 | nature      |     2 |
|  1 | and         |     2 |
|  1 | mathematics |     1 |



#+begin_src sql :engine postgresql :dbhost localhost :dbuser postgres :dbpassword du :database postgres :dbport 5432
  select * from wikipediaarticles where category = 'science';
#+end_src

#+RESULTS:
| id | title  | text      | category | link |
|----+--------+-----------+----------+------|
|  3 | chemie | chemistry | science  |    3 |
|  4 | bio    | biology   | science  |    4 |

*** sql
#+begin_src sh
  cat ~/Documents/hpda0404.csv 
#+end_src

#+RESULTS:

#+begin_src sql :engine postgresql :dbhost localhost :dbuser postgres :dbpassword du :database postgres :dbport 5432
  drop table if exists hpda0401 ;

  create table hpda0401 (
  num int,
  germany varchar(10),
  english varchar(10),
  chinese varchar(10),
  listed int
  ) ;

  insert into hpda0401 (num, germany, english, chinese, listed) values (1, 'eins', 'one','一', 1);
  insert into hpda0401 (num, germany, english, chinese, listed) values (2, 'zwei', 'two','二', 1);
  insert into hpda0401 (num, germany, english, chinese, listed) values (3, 'drei', 'three','三', 2);
  insert into hpda0401 (num, germany, english, chinese, listed) values (6, 'sechs', 'six','六', 2);

  select germany from hpda0401 where  germany = 'zwei';

  select listed, sum(num) as mysum from hpda0401 group by listed;
#+end_src

#+RESULTS:
| DROP TABLE   |       |
|--------------+-------|
| CREATE TABLE |       |
| INSERT 0 1   |       |
| INSERT 0 1   |       |
| INSERT 0 1   |       |
| INSERT 0 1   |       |
| germany      |       |
| zwei         |       |
| listed       | mysum |
| 2            |     9 |
| 1            |     3 |

*** select
#+begin_src python  :results output
  import csv
  from functools import reduce
  path = "/home/si/Documents/hpda0404.csv"
  data = []
  with open(path) as f:
      records = csv.DictReader(f)
      for row in records:
          data.append(row)
      print(data)


  mapiter = map(lambda x: x["germany"], data)
  maplist = [ele for ele in mapiter]
  print(maplist)    

  filteriter = filter(lambda x: x=="zwei", maplist)
  filterlist = [ele for ele in filteriter]
  print("select germany WHERE germany == zwei :", filterlist)

#+end_src

#+RESULTS:
: [{'num': '1', 'germany': 'eins', 'english': 'one', 'chinese': '一', 'listed': '1'}, {'num': '2', 'germany': 'zwei', 'english': 'two', 'chinese': '二', 'listed': '1'}, {'num': '3', 'germany': 'drei', 'english': 'three', 'chinese': '三', 'listed': '2'}, {'num': '6', 'germany': 'sechs', 'english': 'six', 'chinese': '六', 'listed': '2'}]
: ['eins', 'zwei', 'drei', 'sechs']
: select germany WHERE germany == zwei : ['zwei']

*** summation
#+begin_src python  :results output
  import csv
  from functools import reduce
  path = "/home/si/Documents/hpda0404.csv"
  data = []
  with open(path) as f:
      records = csv.DictReader(f)
      for row in records:
          data.append(row)
      print(data)


  iters = map(lambda x: x["listed"], data)
  iterslist = [ele for ele in iters]
  iterset = set(iterslist)
  print("grouped by ", iterset)

  dic = {}
  for i in iterset:
      temp = []
      for d in data:
          for (j, n) in [b for b in map(lambda x: (x["listed"],x["num"]), [d])]:
              if i == j:
                  temp.append(int(n))
      reduer = reduce(lambda x, y:x+y, temp)
      dic[i]= reduer

  print("sum (num) GROUP) BY listed : ", dic)
#+end_src

#+RESULTS:
: [{'num': '1', 'germany': 'eins', 'english': 'one', 'chinese': '一', 'listed': '1'}, {'num': '2', 'germany': 'zwei', 'english': 'two', 'chinese': '二', 'listed': '1'}, {'num': '3', 'germany': 'drei', 'english': 'three', 'chinese': '三', 'listed': '2'}, {'num': '6', 'germany': 'sechs', 'english': 'six', 'chinese': '六', 'listed': '2'}]
: grouped by  {'1', '2'}
: sum (num) GROUP) BY listed :  {'1': 3, '2': 9}

*** join
#+begin_src sh
  cat ~/Documents/hpda0404a.csv 
  cat ~/Documents/hpda0404b.csv
#+end_src

#+RESULTS:
| id | germany | english | chinese | listed |
|  1 | eins    | one     | 一      |      1 |
|  2 | zwei    | two     | 二      |      1 |
|  3 | drei    | three   | 三      |      2 |
|  6 | sechs   | six     | 六      |      2 |
| id | fan     |         |         |        |
|  1 | une     |         |         |        |
|  3 | trois   |         |         |        |
|  4 | quatre  |         |         |        |
|  8 | huit    |         |         |        |

#+begin_src python  :results output
  import csv
  from functools import reduce
  path1 = "/home/si/Documents/hpda0404a.csv"
  path2 = "/home/si/Documents/hpda0404b.csv"
  data1 = []
  with open(path1) as f:
      records = csv.DictReader(f)
      for row in records:
          data1.append(row)
      print(data1)

  data2 = []
  with open(path2) as f:
      records = csv.DictReader(f)
      for row in records:
          data2.append(row)
      print(data2)    


  for a in data1:
      aid = [y for y in map(lambda x: x["id"], [a])]
      for b in data2:
          bid = [y for y in map(lambda x: x["id"], [b])]
          if aid == bid:
              (af1, bf2) = ([y for y in map(lambda x: x["germany"], [a])], [y for y in map(lambda x: x["fan"], [b])])
              print(af1, bf2)

#+end_src

#+RESULTS:
: [{'id': '1', 'germany': 'eins', 'english': 'one', 'chinese': '一', 'listed': '1'}, {'id': '2', 'germany': 'zwei', 'english': 'two', 'chinese': '二', 'listed': '1'}, {'id': '3', 'germany': 'drei', 'english': 'three', 'chinese': '三', 'listed': '2'}, {'id': '6', 'germany': 'sechs', 'english': 'six', 'chinese': '六', 'listed': '2'}]
: [{'id': '1', 'fan': 'une'}, {'id': '3', 'fan': 'trois'}, {'id': '4', 'fan': 'quatre'}, {'id': '8', 'fan': 'huit'}]
: ['eins'] ['une']
: ['drei'] ['trois']

*** 2.1
#+begin_src python :results output
  from nltk.stem.snowball import SnowballStemmer
  from nltk.stem import WordNetLemmatizer

  stemmer = SnowballStemmer("english")
  lemmatizer = WordNetLemmatizer()

  file = "/home/si/Documents/hpda0402wordscount.txt"
  sdict = {}
  ldict = {}
  with open(file, "r") as data:
      datas = data.read()
      words = datas.split(' ')
      for word in words:
          sword = stemmer.stem(word)
          lword = lemmatizer.lemmatize(word)
          if sword in sdict:
              sdict[sword] += 1
          else:
              sdict[sword] = 1

          if lword in ldict:
              ldict[lword] += 1
          else:
              ldict[lword] = 1

      print("---------sdict----------------------")
      for (item, key) in sdict.items():
            print(item, key)

      print("---------ldict----------------------")
      for (item, key) in sdict.items():
          print(item, key)


#+end_src

#+RESULTS:
#+begin_example
---------sdict----------------------
word 43
count 20
from 2
wikipedia 1
the 39
free 1
encyclopedia
th 1
is 16
number 4
of 23
in 11
a 26
document 3
or 10
passag 1
text 6
may 8
be 9
need 1
when 3
text
i 1
requir 2
to 17
stay 1
within 1
certain 2
this 3
particular 1
case 1
academia 1
legal
proceed 1
journal 1
and 20
advertis 1
common 1
use 4
by 5
translat 2
determin 2
price 1
for
th 1
job 1
also 5
calcul 1
measur 3
readabl 1
typing
and 1
read 1
speed 1
usual 4
per 3
minut 1
convert 1
charact 3
five 1
or
six 1
general 2
content 1
detail 2
variat 3
definit 5
softwar 4
fiction
in 1
non 2
fiction 4
see 1
refer 3
sourc 3
extern 1
link 1
definition
thi 1
section 3
doe 1
not 2
cite 1
ani 2
pleas 1
help 1
improv 1
ad 1
citat 1
to
reli 1
unsourc 1
materi 1
challeng 1
removed
vari 1
oper 2
how 2
can 5
occur 1
name 2
what 1
as 10
and
which 1
don't 2
toward 2
total 2
howev 3
especi 1
sinc 1
advent 1
widespread 1
process 4
there
i 1
broad 2
consensus 2
on 7
these 3
henc 1
bottom 1
line 3
integ 1
result
th 1
accept 2
segment 3
rule 6
found 1
most 4
includ 3
how
word 1
boundari 2
are 4
which 3
depend 4
divid 2
defin 2
first 1
trait 1
that 5
space 3
various 1
whitespace
charact 1
such 7
regular 1
an 4
em 1
tab 1
hyphen 2
slash 1
too
differ 1
program 3
give 2
vari 4
result 2
rule
detail 2
whether 1
outsid 1
main 1
footnot 2
endnot 2
hidden 2
text) 1
but 3
behavior
of 1
major 1
applic 2
similar 1
dure 1
era 2
school 1
assign 1
were 3
done 1
in
handwrit 1
with 2
typewrit 1
for 9
often 3
differ 2
today 1
consensus
most 1
import 2
mani 2
student 2
drill 1
articl 1
but
sometim 1
other 1
conjunct 1
exampl 2
some 1
preposit 1
permanent
compound 1
follow 2
up 1
noun 1
long 1
term 1
adject 1
one 1
save 1
time 1
effort 1
counting
word 1
thumb 1
averag 1
was 1
10 1
rules
hav 1
fallen 1
waysid 1
featur 1
text
segment 1
mention 1
earlier 2
now 1
standard 1
arbit 1
becaus 2
it 5
larg 2
consist 1
across 1
and
appl 1
fast 1
effortless 1
costless 1
alreadi 1
of
a 1
abstract 1
list 2
bibliographi 1
tabl 1
figure
capt 1
person 1
charg 1
teacher 1
client 1
their 1
choic 1
user 1
worker 1
simply
select 1
exclud 1
element 1
accord 1
watch 1
automat 1
updat 1
modern 1
web 1
browsers
support 1
via 2
extens 1
javascript 1
bookmarklet 1
script 1
host 1
websit 1
word
processor 1
unix 1
like 1
system 1
wc 1
specif 1
counting
a 1
explain 1
exact 1
strict 1
thus 1
acceptable
in 1
novelist 1
jane 1
smiley 2
suggest 1
length 7
qualiti 1
novel 8
vary
tremend 1
typic 1
between 2
while 3
nation 1
write 1
month
requir 1
at 3
least 1
there 1
no 1
firm 1
novella 2
novel
i 1
arbitrari 1
literari 1
work 1
difficult 1
categoris 1
extent 1
up
to 1
writer 2
subgenr 1
chapter 1
book 1
children 1
start 1
about 1
a
typ 1
mysteri 1
might 1
rang 1
thriller 1
could 1
over 2
words
th 1
scienc 1
fantasi 1
america 1
specifi 1
each 1
categori 1
nebula 1
award 1
categories
classification	word 1
novelett 1
short 1
stori 1
under 1
words
in 1
academ 1
dissert 2
great 1
predomin 1
subject
numer 1
american 1
univers 1
limit 1
ph.d. 1
bar 1
special 1
permiss 1
exceed 1
limit
 1
---------ldict----------------------
word 43
count 20
from 2
wikipedia 1
the 39
free 1
encyclopedia
th 1
is 16
number 4
of 23
in 11
a 26
document 3
or 10
passag 1
text 6
may 8
be 9
need 1
when 3
text
i 1
requir 2
to 17
stay 1
within 1
certain 2
this 3
particular 1
case 1
academia 1
legal
proceed 1
journal 1
and 20
advertis 1
common 1
use 4
by 5
translat 2
determin 2
price 1
for
th 1
job 1
also 5
calcul 1
measur 3
readabl 1
typing
and 1
read 1
speed 1
usual 4
per 3
minut 1
convert 1
charact 3
five 1
or
six 1
general 2
content 1
detail 2
variat 3
definit 5
softwar 4
fiction
in 1
non 2
fiction 4
see 1
refer 3
sourc 3
extern 1
link 1
definition
thi 1
section 3
doe 1
not 2
cite 1
ani 2
pleas 1
help 1
improv 1
ad 1
citat 1
to
reli 1
unsourc 1
materi 1
challeng 1
removed
vari 1
oper 2
how 2
can 5
occur 1
name 2
what 1
as 10
and
which 1
don't 2
toward 2
total 2
howev 3
especi 1
sinc 1
advent 1
widespread 1
process 4
there
i 1
broad 2
consensus 2
on 7
these 3
henc 1
bottom 1
line 3
integ 1
result
th 1
accept 2
segment 3
rule 6
found 1
most 4
includ 3
how
word 1
boundari 2
are 4
which 3
depend 4
divid 2
defin 2
first 1
trait 1
that 5
space 3
various 1
whitespace
charact 1
such 7
regular 1
an 4
em 1
tab 1
hyphen 2
slash 1
too
differ 1
program 3
give 2
vari 4
result 2
rule
detail 2
whether 1
outsid 1
main 1
footnot 2
endnot 2
hidden 2
text) 1
but 3
behavior
of 1
major 1
applic 2
similar 1
dure 1
era 2
school 1
assign 1
were 3
done 1
in
handwrit 1
with 2
typewrit 1
for 9
often 3
differ 2
today 1
consensus
most 1
import 2
mani 2
student 2
drill 1
articl 1
but
sometim 1
other 1
conjunct 1
exampl 2
some 1
preposit 1
permanent
compound 1
follow 2
up 1
noun 1
long 1
term 1
adject 1
one 1
save 1
time 1
effort 1
counting
word 1
thumb 1
averag 1
was 1
10 1
rules
hav 1
fallen 1
waysid 1
featur 1
text
segment 1
mention 1
earlier 2
now 1
standard 1
arbit 1
becaus 2
it 5
larg 2
consist 1
across 1
and
appl 1
fast 1
effortless 1
costless 1
alreadi 1
of
a 1
abstract 1
list 2
bibliographi 1
tabl 1
figure
capt 1
person 1
charg 1
teacher 1
client 1
their 1
choic 1
user 1
worker 1
simply
select 1
exclud 1
element 1
accord 1
watch 1
automat 1
updat 1
modern 1
web 1
browsers
support 1
via 2
extens 1
javascript 1
bookmarklet 1
script 1
host 1
websit 1
word
processor 1
unix 1
like 1
system 1
wc 1
specif 1
counting
a 1
explain 1
exact 1
strict 1
thus 1
acceptable
in 1
novelist 1
jane 1
smiley 2
suggest 1
length 7
qualiti 1
novel 8
vary
tremend 1
typic 1
between 2
while 3
nation 1
write 1
month
requir 1
at 3
least 1
there 1
no 1
firm 1
novella 2
novel
i 1
arbitrari 1
literari 1
work 1
difficult 1
categoris 1
extent 1
up
to 1
writer 2
subgenr 1
chapter 1
book 1
children 1
start 1
about 1
a
typ 1
mysteri 1
might 1
rang 1
thriller 1
could 1
over 2
words
th 1
scienc 1
fantasi 1
america 1
specifi 1
each 1
categori 1
nebula 1
award 1
categories
classification	word 1
novelett 1
short 1
stori 1
under 1
words
in 1
academ 1
dissert 2
great 1
predomin 1
subject
numer 1
american 1
univers 1
limit 1
ph.d. 1
bar 1
special 1
permiss 1
exceed 1
limit
 1
#+end_example
** 05
#+begin_src python :results output
import csv

class dataflow:
    def __init__(self):
        self.data = []

    def read(filename):
        d = dataflow()
        with open(filename, newline='') as csvfile:
            spamreader = csv.reader(csvfile)
            for row in spamreader:
                d.data.append(row)
        return d

    def map(self, func):
        d = dataflow()
        for x in self.data:
            d.data.append(func(x))
        return d

    def filter(self, func):
        d = dataflow()
        for x in self.data:
            if func(x):
                d.data.append(x)
        return d

    def write(self, filename):
        d = dataflow()
        with open(filename, 'w', newline='') as csvfile:
            spamwriter = csv.writer(csvfile, quoting=csv.QUOTE_MINIMAL)
            for d in self.data:
                spamwriter.writerow(d)
        return d
    def __str__(self):
        return str(self.data)


d = dataflow.read("/home/si/Documents/hpda/05/file.csv")
print(d)
flat = d.map(lambda t: (t[0], eval(t[3])))
bd = flat.filter(lambda t: "HPDA" in t[1])
bd.write("/home/si/Documents/hpda/05/out.csv")

#+end_src

#+RESULTS:
: [['4711', 'Max Musterman', 'max.musterman@uni-goettingen.de', "['HPDA', 'MODULE2'] "], ['4710', 'Max musterman', 'max.musterman@uni-goettingen.doe', "['HPDA'] "], ['4712', 'Max Musterman', 'max.musterman@uni-goettingen.de', "['MODULE2'] "], ['4713', 'Max musterman', 'max.musterman@uni-goettingen.doe', "['HPDA'] "], ['4714', 'Max musterman', 'max.musterman@uni-goettingen.doe', "['HPDA'] "], ['4715', 'Max Musterman', 'max.musterman@uni-goettingen.de', "['MODULE2'] "], ['4716', 'Max musterman', 'max.musterman@uni-goettingen.doe', "['HPDA'] "]]

** 06
MongoDB
#+begin_src mongo :db testdatabase
  show dbs
#+end_src

#+RESULTS:
: admin         0.000GB
: config        0.000GB
: local         0.000GB
: testdatabase  0.000GB

#+begin_src mongo :db testdatabase
  use testdatabase
  db.getCollectionNames()
#+end_src

#+RESULTS:
: switched to db testdatabase
: [ "testColl" ]


#+begin_src  mongo :db testdatabase
  use testdatabase;
  db.wiki.drop();
  db.createCollection("wiki");
  show collections;
#+end_src

#+RESULTS:
: switched to db testdatabase
: true
: { "ok" : 1 }
: testColl
: wiki


#+begin_src  mongo :db testdatabase
  use testdatabase;
  db.wiki.insert({_id:1, "person":"Gauss","Beruf":"Mathematiker" })
  db.wiki.find()
#+end_src

#+RESULTS:
: switched to db testdatabase
: WriteResult({ "nInserted" : 1 })
: { "_id" : 1, "person" : "Gauss", "Beruf" : "Mathematiker" }


#+begin_src  mongo :db testdatabase
  use testdatabase;
  db.wiki.update({"person":"Gauss"},{"Beruf": "Mathematiker Physiker" })
  db.wiki.find()
#+end_src

#+RESULTS:
: switched to db testdatabase
: WriteResult({ "nMatched" : 1, "nUpserted" : 0, "nModified" : 1 })
: { "_id" : 1, "Beruf" : "Mathematiker Physiker" }



#+begin_src  mongo :db testdatabase
  use testdatabase;
  db.wiki.update({"person":"Gauss"}, {"Beruf": "Mathematiker Physiker", "Wohnsite": "Göttingen Hannover"})
  db.wiki.find()
#+end_src

#+RESULTS:
: switched to db testdatabase
: WriteResult({ "nMatched" : 0, "nUpserted" : 0, "nModified" : 0 })
: { "_id" : 1, "Beruf" : "Mathematiker Physiker" }




#+begin_src  mongo :db testdatabase
  use testdatabase;
  db.wiki.drop()
#+end_src

#+RESULTS:
: switched to db testdatabase
: true


